package com.javarush.test.level00.lesson03;

/**
 * Created by Dmitry on 22/11/15.
 */

/* На дворе 31 век
Написать программу, выводящую на экран нынешний год. На дворе 31 век, если что.

Подсказка:
Возьмите текущий год и измените век на 31.
Вывести нужно число, состоящее из четырех цифр.
*/

public class task02 {

    public static void main(String[] args)
    {
        //напишите тут ваш код
        int a = 15;
        String b = "30";
        System.out.println(b+a);
    }
}
