package com.javarush.test.level00.lesson03;

/**
 * Created by Dmitry on 22/11/15.
 */

/* Элли самая красивая
Написать программу, выводящую на экран надпись «Элли самая красивая» 5 раз. Каждый раз – с новой строки.
Пример вывода на экран:
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая
*/

public class task01 {

    public static void main(String[] args) {

        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");

    }
}
